[Killed] ArrayDeclaration
main/components/Staff/StaffTable.js:26:21
 
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
 
-    const columns = [
-        {
-            Header: 'id',
-            accessor: 'id',
-        },
-        {
-            Header: 'courseId',
-            accessor: 'courseId',
-        },
-        {
-            Header: 'githubId',
-            accessor: 'githubId',
-        },
-
-    ];
+    const columns = [];
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
killedBy: StaffIndexPage tests renders three Staffs correctly for admin
statusReason: Error: Unable to find an element by: [data-testid="StaffTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/Staff/StaffTable.js:42:88
 
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "StaffTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StaffTable"));
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
 
     return <OurTable
killedBy: StaffIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StaffTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
