[Killed] BlockStatement
main/components/Courses/CoursesTable.js:16:34
         navigate(`/courses/join/${cell.row.values.id}`);
     };
 
-     const staffCallback = () => {
-        navigate(`/staff`);
-    };
+     const staffCallback = () => {};
 
      const editCallback = (cell) => {
killedBy: UserTable tests Staff button navigates to the staff page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/staff"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:17:18
     };
 
      const staffCallback = () => {
-        navigate(`/staff`);
+        navigate(``);
     };
 
killedBy: UserTable tests Staff button navigates to the staff page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/staff"
Received: ""

Number of calls: 1

<html>

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:69:89
   
      ];
 
-     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
-     }
+     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
      
      columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable"));
killedBy: CourseIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:70:71
      ];
 
      if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-         columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
+         columns.push(ButtonColumn("Staff", "primary", staffCallback, ""));
          columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
killedBy: UserTable tests Has the expected colum headers and content for instructorUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Staff-button"]

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>
