[Killed] StringLiteral
main/components/Staff/StaffForm.js:4:67
 import { Button, Form, Row, Col } from 'react-bootstrap';
 import { useForm } from 'react-hook-form'
 
-function StaffForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function StaffForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     // Stryker disable all
killedBy: StaffForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Staff/StaffForm.js:22:18
 
 
             <Row>
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="StaffForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="StaffForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
             </Row>
 
killedBy: StaffForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/Staff/StaffForm.js:22:18
 
 
             <Row>
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="StaffForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
             </Row>
 
killedBy: StaffEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StaffForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/Staff/StaffForm.js:48:54
                             id="courseId"
                             type="number"
                             isInvalid={Boolean(errors.courseId)}
-                            {...register("courseId", { required: true })}
+                            {...register("courseId", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: StaffForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /courseId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Staff/StaffForm.js:51:30
                             {...register("courseId", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.courseId && 'courseId is required.'}
+                            {errors.courseId || 'courseId is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: StaffForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] StringLiteral
main/components/Staff/StaffForm.js:63:42
                             id="githubId"
                             type="number"
                             isInvalid={Boolean(errors.githubId)}
-                            {...register("githubId", { required: true })}
+                            {...register("", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: StaffForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
