[Killed] BlockStatement
src/main/pages/CourseIndexPage.js:11:30
 export default function CourseIndexPage() {
 
   const { data: currentUser } = useCurrentUser();
-  const createButton = () => {  
-    
-      return (
-          <Button
-              variant="primary"
-              href="/courses/create"
-              style={{ float: "right" }}
-          >
-              Create Course 
-          </Button>
-      )
-    
-  }
+  const createButton = () => {}
   
   const { data: courses, error: _error, status: _status } =
killedBy: CourseIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
src/main/pages/CourseIndexPage.js:37:12
     return (
       <BasicLayout>
         <div className="pt-2">
-          {(hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && createButton()}
+          {false}
           <h1>Course</h1>
           <CoursesTable courses={courses} currentUser={currentUser} />
killedBy: CourseIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
