[Killed] BooleanLiteral
src/main/pages/StaffCreatePage.js:7:52
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function StaffCreatePage({storybook=false}) {
+export default function StaffCreatePage({storybook=true}) {
 
     const objectToAxiosParams = (staff) => ({
killedBy: StaffCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/staff"}

Number of calls: 0

[Killed] ArrowFunction
src/main/pages/StaffCreatePage.js:9:33
 
 export default function StaffCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (staff) => ({
-        url: "/api/staff/post",
-        method: "POST",
-        params: {
-        courseId: staff.courseId,
-        githubId: staff.githubId
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (staff) => {
killedBy: StaffCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/StaffCreatePage.js:9:45
 
 export default function StaffCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (staff) => ({
-        url: "/api/staff/post",
-        method: "POST",
-        params: {
-        courseId: staff.courseId,
-        githubId: staff.githubId
-        }
-    });
+    const objectToAxiosParams = (staff) => ({});
 
     const onSuccess = (staff) => {
killedBy: StaffCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/StaffCreatePage.js:11:17
 
     const objectToAxiosParams = (staff) => ({
         url: "/api/staff/post",
-        method: "POST",
+        method: "",
         params: {
         courseId: staff.courseId,
killedBy: StaffCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/StaffCreatePage.js:12:17
     const objectToAxiosParams = (staff) => ({
         url: "/api/staff/post",
         method: "POST",
-        params: {
-        courseId: staff.courseId,
-        githubId: staff.githubId
-        }
+        params: {}
     });
 
killedBy: StaffCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "courseId": "4",
-   "githubId": "5",

[Killed] BlockStatement
src/main/pages/StaffCreatePage.js:18:34
         }
     });
 
-    const onSuccess = (staff) => {
-        toast(`New staff created - id: ${staff.id}`);
-    }
+    const onSuccess = (staff) => {}
 
     const mutation = useBackendMutation(
killedBy: StaffCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New staff created - id: 1"

Number of calls: 0

[Killed] BlockStatement
src/main/pages/StaffCreatePage.js:35:34
         mutation.mutate(data);
     }
     
-    if (isSuccess && !storybook) {
-        return <Navigate to="/staff" />
-    }
+    if (isSuccess && !storybook) {}
 
     return (
killedBy: StaffCreatePage tests on submit, makes request to backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/staff"}

Number of calls: 0
