[Killed] BooleanLiteral
src/main/pages/StaffEditPage.js:8:53
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function StaffEditPage({ storybook = false }) {
+export default function StaffEditPage({ storybook = true }) {
     let { id } = useParams();
 
killedBy: StaffEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/staff"}

Number of calls: 0

[Killed] ObjectLiteral
src/main/pages/StaffEditPage.js:18:25
             {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
                 method: "GET",
                 url: `/api/staff/get`,
-                params: {
-                    id
-                }
+                params: {}
             }
         );
killedBy: StaffEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="StaffForm-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/StaffEditPage.js:25:36
         );
 
 
-    const objectToAxiosPutParams = (staff) => ({
-        url: "/api/staff/update",
-        method: "PUT",
-        params: {
-            id: staff.id,
-            courseId: staff.courseId,
-            githubId: staff.githubId
-        },
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (staff) => {
killedBy: StaffEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/StaffEditPage.js:25:48
         );
 
 
-    const objectToAxiosPutParams = (staff) => ({
-        url: "/api/staff/update",
-        method: "PUT",
-        params: {
-            id: staff.id,
-            courseId: staff.courseId,
-            githubId: staff.githubId
-        },
-    });
+    const objectToAxiosPutParams = (staff) => ({});
 
     const onSuccess = (staff) => {
killedBy: StaffEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/StaffEditPage.js:26:14
 
 
     const objectToAxiosPutParams = (staff) => ({
-        url: "/api/staff/update",
+        url: "",
         method: "PUT",
         params: {
killedBy: StaffEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/StaffEditPage.js:35:34
         },
     });
 
-    const onSuccess = (staff) => {
-        toast(`Staff Updated - id: ${staff.id} courseid: ${staff.courseId} githubid: ${staff.githubId}`);
-    }
+    const onSuccess = (staff) => {}
 
     const mutation = useBackendMutation(
killedBy: StaffEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
src/main/pages/StaffEditPage.js:61:21
             <div className="pt-2">
                 <h1>Edit Staff</h1>
                 {
-                    staff && <StaffForm initialContents={staff} submitAction={onSubmit} buttonLabel="Update" />
+                    true
                 }
             </div>
killedBy: StaffEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="StaffForm-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
src/main/pages/StaffEditPage.js:61:21
             <div className="pt-2">
                 <h1>Edit Staff</h1>
                 {
-                    staff && <StaffForm initialContents={staff} submitAction={onSubmit} buttonLabel="Update" />
+                    false
                 }
             </div>
killedBy: StaffEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="StaffForm-courseId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
