[Killed] BlockStatement
src/main/pages/StaffIndexPage.js:12:30
 export default function StaffIndexPage() {
 
   const { data: currentUser } = useCurrentUser();
-  const createButton = () => {  
-    
-      return (
-          <Button
-              variant="primary"
-              href="/staff/create"
-              style={{ float: "right" }}
-          >
-              Create Staff 
-          </Button>
-      )
-    
-  }
+  const createButton = () => {}
   
   const { data: staff, error: _error, status: _status } =
killedBy: StaffIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Staff/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/StaffIndexPage.js:18:31
           <Button
               variant="primary"
               href="/staff/create"
-              style={{ float: "right" }}
+              style={{ float: "" }}
           >
               Create Staff 
killedBy: StaffIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ConditionalExpression
src/main/pages/StaffIndexPage.js:38:12
     return (
       <BasicLayout>
         <div className="pt-2">
-          {(hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && createButton()}
+          {true}
           <h1>Staff</h1>
           <StaffTable staff={staff} currentUser={currentUser} />
killedBy: StaffIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Staff/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
