[Killed] BlockStatement
main/components/Staff/StaffTable.js:14:36
     const navigate = useNavigate();
 
 
-    const editCallback = (cell) => {
-        navigate(`/staff/edit/${cell.row.values.id}`);
-    };
+    const editCallback = (cell) => {};
 
     const deleteMutation = useBackendMutation(
killedBy: StaffTable tests clicking Edit button navigates to edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/staff/edit/1"

Number of calls: 0

[Killed] StringLiteral
main/components/Staff/StaffTable.js:15:18
 
 
     const editCallback = (cell) => {
-        navigate(`/staff/edit/${cell.row.values.id}`);
+        navigate(``);
     };
 
killedBy: StaffTable tests clicking Edit button navigates to edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/staff/edit/1"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/components/Staff/StaffTable.js:23:44
         { onSuccess: onDeleteSuccess }
     );
 
-    const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
+    const deleteCallback = async (cell) => {}
 
     const columns = [
killedBy: StaffIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Staff with id 1 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Staff/StaffTable.js:30:9
             Header: 'id',
             accessor: 'id',
         },
-        {
-            Header: 'courseId',
-            accessor: 'courseId',
-        },
+        {},
         {
             Header: 'githubId',
killedBy: StaffIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Staff/StaffTable.js:34:9
             Header: 'courseId',
             accessor: 'courseId',
         },
-        {
-            Header: 'githubId',
-            accessor: 'githubId',
-        },
+        {},
 
     ];
killedBy: StaffIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Staff/StaffTable.js:36:23
         },
         {
             Header: 'githubId',
-            accessor: 'githubId',
+            accessor: "",
         },
 
killedBy: StaffTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  scottpchow23
Received:

[Killed] StringLiteral
main/components/Staff/StaffTable.js:42:35
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "StaffTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "StaffTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StaffTable"));
     }
killedBy: StaffIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Staff/StaffTable.js:43:35
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "StaffTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StaffTable"));
+        columns.push(ButtonColumn("", "danger", deleteCallback, "StaffTable"));
     }
 
killedBy: StaffIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Staff/StaffTable.js:43:71
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "StaffTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "StaffTable"));
+        columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
     }
 
killedBy: StaffTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StaffTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Staff/StaffTable.js:49:17
     return <OurTable
         data={staff}
         columns={columns}
-        testid={"StaffTable"} />;
+        testid={""} />;
 };
 
killedBy: StaffIndexPage tests renders three Staffs correctly for admin
statusReason: Error: Unable to find an element by: [data-testid="StaffTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
