[Killed] BlockStatement
src/main/pages/HomePage.js:10:40
 
     const { data: currentUser } = useCurrentUser();
 
-    const getPartOfDayGreeting = () => {
-        const hour = new Date().getHours();
-        if (hour <= 12) return "Good morning";
-        if (hour <= 18) return "Good afternoon";
-        return "Good evening";
-    };
+    const getPartOfDayGreeting = () => {};
 
     const greeting = getPartOfDayGreeting();
killedBy: HomePage tests shows greeting for logged-in users with dynamic time of day
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Good (morning|afternoon|evening), Please Sign In First to Proceed/
Received string:  ", Please Sign In First to Proceed"

[Killed] ConditionalExpression
src/main/pages/HomePage.js:12:13
 
     const getPartOfDayGreeting = () => {
         const hour = new Date().getHours();
-        if (hour <= 12) return "Good morning";
+        if (true) return "Good morning";
         if (hour <= 18) return "Good afternoon";
         return "Good evening";
killedBy: HomePage greetings for not logged in users at different times of the day shows "Good afternoon, Please Sign In First to Proceed" for not logged-in user at 14 hours
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Good afternoon, Please Sign In First to Proceed/i
Received string:  "Good morning, Please Sign In First to Proceed"

[Killed] EqualityOperator
src/main/pages/HomePage.js:12:13
 
     const getPartOfDayGreeting = () => {
         const hour = new Date().getHours();
-        if (hour <= 12) return "Good morning";
+        if (hour > 12) return "Good morning";
         if (hour <= 18) return "Good afternoon";
         return "Good evening";
killedBy: HomePage greetings for not logged in users at different times of the day shows "Good morning, Please Sign In First to Proceed" for not logged-in user at 9 hours
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Good morning, Please Sign In First to Proceed/i
Received string:  "Good afternoon, Please Sign In First to Proceed"

[Killed] ConditionalExpression
src/main/pages/HomePage.js:13:13
     const getPartOfDayGreeting = () => {
         const hour = new Date().getHours();
         if (hour <= 12) return "Good morning";
-        if (hour <= 18) return "Good afternoon";
+        if (false) return "Good afternoon";
         return "Good evening";
     };
killedBy: HomePage greetings for not logged in users at different times of the day shows "Good afternoon, Please Sign In First to Proceed" for not logged-in user at 14 hours
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Good afternoon, Please Sign In First to Proceed/i
Received string:  "Good evening, Please Sign In First to Proceed"

[Killed] ConditionalExpression
src/main/pages/HomePage.js:13:13
     const getPartOfDayGreeting = () => {
         const hour = new Date().getHours();
         if (hour <= 12) return "Good morning";
-        if (hour <= 18) return "Good afternoon";
+        if (true) return "Good afternoon";
         return "Good evening";
     };
killedBy: HomePage greetings for not logged in users at different times of the day shows "Good evening, Please Sign In First to Proceed" for not logged-in user at 19 hours
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Good evening, Please Sign In First to Proceed/i
Received string:  "Good afternoon, Please Sign In First to Proceed"

[Killed] ArrowFunction
src/main/pages/HomePage.js:19:28
 
     const greeting = getPartOfDayGreeting();
 
-    const renderGreeting = (username) => (
-        <h1 
-            data-testid="homePage-title" 
-            style={{ 
-                fontSize: "75px", 
-                borderRadius: "7px", 
-                backgroundColor: "white", 
-                opacity: ".9" 
-            }} 
-            className="text-center border-0 my-3"
-        >
-            {greeting}, {username}
-        </h1>
-    );
+    const renderGreeting = () => undefined;
 
     const renderInfoSection = () => (
killedBy: HomePage tests expected CSS properties
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="homePage-title"]

<body>
  <div>
    <div
      data-testid="HomePage-main-div"
    >
      <div

[Killed] StringLiteral
src/main/pages/HomePage.js:53:27
    
 
     return (
-        <div data-testid={"HomePage-main-div"}>
+        <div data-testid={""}>
             <BasicLayout>
                 {renderGreeting(currentUser.loggedIn ? currentUser.root.user.githubLogin : "Please Sign In First to Proceed")}
killedBy: HomePage greetings for not logged in users at different times of the day shows "Good morning, Please Sign In First to Proceed" for not logged-in user at 9 hours
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HomePage-main-div"]

<body>
  <div>
    <div
      data-testid=""
    >
      <div
