[Killed] StringLiteral
src/main/pages/CoursesShowPage.js:38:30
                 {/* Course Roster Upload Link */}
                 <p>
                     <strong>Course Roster:</strong>
-                    <a href={`/courses/${id}/roster-upload`}>Upload Roster</a>
+                    <a href={``}>Upload Roster</a>
                 </p>
                 {/* Staff Roster */}
killedBy: CoursesShowPage tests check that the course links are correct
statusReason: Error: expect(element).toHaveAttribute("href", "/courses/17/roster-upload") // element.getAttribute("href") === "/courses/17/roster-upload"

Expected the element to have attribute:
  href="/courses/17/roster-upload"
Received:
  href=""
