[Killed] StringLiteral
main/components/Courses/ShowTable.js:54:70
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Staff", "primary", staffCallback, "ShowTable"));
+        columns.push(ButtonColumn("Staff", "primary", staffCallback, ""));
         columns.push(ButtonColumn("Edit", "#AAFF00", editCallback, "ShowTable"));
     }
killedBy: UserTable tests Has the expected colum headers and content for instructorUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShowTable-cell-row-0-col-Staff-button"]

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>
