[Killed] BlockStatement
main/components/Courses/ShowTable.js:51:88
 
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Staff", "primary", staffCallback, "ShowTable"));
-        columns.push(ButtonColumn("Edit", "#AAFF00", editCallback, "ShowTable"));
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
 
     return (
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShowTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>

[Killed] StringLiteral
main/components/Courses/ShowTable.js:52:35
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Staff", "primary", staffCallback, "ShowTable"));
+        columns.push(ButtonColumn("", "primary", staffCallback, "ShowTable"));
         columns.push(ButtonColumn("Edit", "#AAFF00", editCallback, "ShowTable"));
     }
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/ShowTable.js:53:68
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push(ButtonColumn("Staff", "primary", staffCallback, "ShowTable"));
-        columns.push(ButtonColumn("Edit", "#AAFF00", editCallback, "ShowTable"));
+        columns.push(ButtonColumn("Edit", "#AAFF00", editCallback, ""));
     }
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShowTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>

[Killed] StringLiteral
main/components/Courses/ShowTable.js:53:35
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push(ButtonColumn("Staff", "primary", staffCallback, "ShowTable"));
-        columns.push(ButtonColumn("Edit", "#AAFF00", editCallback, "ShowTable"));
+        columns.push(ButtonColumn("", "#AAFF00", editCallback, "ShowTable"));
     }
 
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
