[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:97:43
                                 <option 
                                 key={index} 
                                 value={school}
-                                selected={school === initialContents?.school ? true : false}>
+                                selected={true ? true : false}>
                                     {school}
                                 </option>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(UC Santa Barbara)

Expected the element to have value:
  UC Santa Barbara
Received:
  UC San Diego
