[Survived] BlockStatement
main/components/Courses/CoursesTable.js:24:38
         navigate(`/courses/edit/${cell.row.values.id}`);
     };
 
-    const courseCallback = (cell) => {
-        navigate(`/courses/show/${cell.row.values.id}`);
-    };
+    const courseCallback = (cell) => {};
 
     // Stryker disable all : hard to test for query caching

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:73:88
 
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Show", "primary", courseCallback, "CoursesTable"));
-        columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
 
     columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable"));
killedBy: CourseIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:75:70
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push(ButtonColumn("Show", "primary", courseCallback, "CoursesTable"));
-        columns.push(ButtonColumn("Staff", "primary", staffCallback, "CoursesTable"));
+        columns.push(ButtonColumn("Staff", "primary", staffCallback, ""));
         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
killedBy: UserTable tests Has the expected colum headers and content for instructorUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Staff-button"]

<body>
  <div>
    <div>
      Total Courses: 
      3
    </div>
