[Killed] EqualityOperator
src/main/pages/CoursesShowPage.js:25:24
     []
         );
         let checkLength = [];
-        if (courses && courses.length !== 0) {
+        if (courses && courses.length === 0) {
             checkLength = [courses];
         } else if (courses) {
killedBy: CoursesShowPage tests renders course correctly for admin
statusReason: TypeError: data.forEach is not a function

[Killed] ConditionalExpression
src/main/pages/CoursesShowPage.js:25:24
     []
         );
         let checkLength = [];
-        if (courses && courses.length !== 0) {
+        if (courses && true) {
             checkLength = [courses];
         } else if (courses) {
killedBy: CoursesShowPage tests renders empty table when backend unavailable, admin
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="CoursesTable-cell-row-0-col-id" role="cell" /> instead

[Survived] BlockStatement
src/main/pages/CoursesShowPage.js:27:29
         let checkLength = [];
         if (courses && courses.length !== 0) {
             checkLength = [courses];
-        } else if (courses) {
-            checkLength = courses;
-        }
+        } else if (courses) {}
 
     return (

[Survived] ConditionalExpression
src/main/pages/CoursesShowPage.js:27:20
         let checkLength = [];
         if (courses && courses.length !== 0) {
             checkLength = [courses];
-        } else if (courses) {
+        } else if (true) {
             checkLength = courses;
         }

[Survived] StringLiteral
src/main/pages/CoursesShowPage.js:47:26
               {/* Staff Roster */}
               <p>
                 <strong>Staff Roster:</strong>{" "}
-                <a href={`/courses/${id}/staff-roster`}>View Staff</a>
+                <a href={``}>View Staff</a>
               </p>
               {/* Student Roster */}

[Survived] StringLiteral
src/main/pages/CoursesShowPage.js:52:26
               {/* Student Roster */}
               <p>
                 <strong>Student Roster:</strong>{" "}
-                <a href={`/courses/${id}/student-roster`}>View Students</a>
+                <a href={``}>View Students</a>
               </p>
             </div>
