[Killed] ArrowFunction
src/main/pages/SchoolCreatePage.js:10:33
 export default function SchoolCreatePage({storybook=false}) {
 
 
-    const objectToAxiosParams = (school) => ({
-        url: "/api/schools/post",
-        method: "POST",
-        data: school
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (school) => {
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/SchoolCreatePage.js:10:46
 export default function SchoolCreatePage({storybook=false}) {
 
 
-    const objectToAxiosParams = (school) => ({
-        url: "/api/schools/post",
-        method: "POST",
-        data: school
-    });
+    const objectToAxiosParams = (school) => ({});
 
     const onSuccess = (school) => {
killedBy: SchoolCreatePage tests on submit, makes request to backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
