[Killed] ObjectLiteral
src/main/pages/SchoolEditPage.js:15:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/schools?abbrev=${abbrev}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/schools`,
-        params: {
-          abbrev
-        }
-      }
+      {}
     );
 
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolForm-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
src/main/pages/SchoolEditPage.js:18:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/schools`,
-        params: {
-          abbrev
-        }
+        params: {}
       }
     );
killedBy: SchoolEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="SchoolForm-abbrev"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
