[Survived] BlockStatement
main/components/Courses/CoursesForm.js:9:32
 
 import axios from 'axios';
 
-function formatDateToISO(date) {
-    const pad = (n) => n.toString().padStart(2, '0');
-    return `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(date.getDate())}T${pad(date.getHours())}:${pad(date.getMinutes())}`;
-}
+function formatDateToISO(date) {}
 
 function defaultStartDate() {

[Survived] ArrowFunction
main/components/Courses/CoursesForm.js:10:17
 import axios from 'axios';
 
 function formatDateToISO(date) {
-    const pad = (n) => n.toString().padStart(2, '0');
+    const pad = () => undefined;
     return `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(date.getDate())}T${pad(date.getHours())}:${pad(date.getMinutes())}`;
 }

[Survived] ArithmeticOperator
main/components/Courses/CoursesForm.js:11:41
 
 function formatDateToISO(date) {
     const pad = (n) => n.toString().padStart(2, '0');
-    return `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(date.getDate())}T${pad(date.getHours())}:${pad(date.getMinutes())}`;
+    return `${date.getFullYear()}-${pad(date.getMonth() - 1)}-${pad(date.getDate())}T${pad(date.getHours())}:${pad(date.getMinutes())}`;
 }
 

[Survived] BlockStatement
main/components/Courses/CoursesForm.js:14:29
     return `${date.getFullYear()}-${pad(date.getMonth() + 1)}-${pad(date.getDate())}T${pad(date.getHours())}:${pad(date.getMinutes())}`;
 }
 
-function defaultStartDate() {
-    const today = new Date();
-    today.setHours(0, 1, 0, 0);
-    var startDateISO = formatDateToISO(today);
-    return startDateISO;
-}
+function defaultStartDate() {}
 
 function defaultEndDate() {

[Survived] BlockStatement
main/components/Courses/CoursesForm.js:21:27
     return startDateISO;
 }
 
-function defaultEndDate() {
-    const endDate = new Date();
-    endDate.setDate(endDate.getDate() + 120);
-    endDate.setHours(23, 59, 0, 0);
-    var endDateISO = formatDateToISO(endDate);
-    return endDateISO;
-}
+function defaultEndDate() {}
 
 function CoursesForm({ initialContents, submitAction, buttonLabel = "Create"}) { // schooloptions = drop down menu items

[Survived] ArithmeticOperator
main/components/Courses/CoursesForm.js:23:21
 
 function defaultEndDate() {
     const endDate = new Date();
-    endDate.setDate(endDate.getDate() + 120);
+    endDate.setDate(endDate.getDate() - 120);
     endDate.setHours(23, 59, 0, 0);
     var endDateISO = formatDateToISO(endDate);

[Killed] BlockStatement
main/components/Courses/CoursesForm.js:31:21
 
 function CoursesForm({ initialContents, submitAction, buttonLabel = "Create"}) { // schooloptions = drop down menu items
     const [schoolOptions, setSchoolOptions] = useState([]);
-    useEffect(() => {
-        enableEndDateValidation(); // Call the function to enable end date validation
-        axios.get('/api/schools/all')
-            .then((data) => {
-                return data.data;
-            })
-            .then((jsonData) => {
-                const nameArray = Array.isArray(jsonData) ? jsonData.map(item => item.name) : [jsonData.name];
-                setSchoolOptions(nameArray);
-            })
-    }, 
+    useEffect(() => {}, 
     // Stryker disable all
     []); 
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(UC Santa Barbara)

Expected the element to have value:
  UC Santa Barbara
Received:
  undefined

[Killed] BlockStatement
main/components/Courses/CoursesForm.js:37:33
             .then((data) => {
                 return data.data;
             })
-            .then((jsonData) => {
-                const nameArray = Array.isArray(jsonData) ? jsonData.map(item => item.name) : [jsonData.name];
-                setSchoolOptions(nameArray);
-            })
+            .then((jsonData) => {})
     }, 
     // Stryker disable all
killedBy: CoursesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ArrowFunction
main/components/Courses/CoursesForm.js:38:74
                 return data.data;
             })
             .then((jsonData) => {
-                const nameArray = Array.isArray(jsonData) ? jsonData.map(item => item.name) : [jsonData.name];
+                const nameArray = Array.isArray(jsonData) ? jsonData.map(() => undefined) : [jsonData.name];
                 setSchoolOptions(nameArray);
             })
killedBy: CoursesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ArrowFunction
main/components/Courses/CoursesForm.js:111:48
                             {...register("school", { required: true })}
                         >
                             <option value="">Select a school</option>
-                            {schoolOptions.map((school, index) => (
-                                <option 
-                                key={index} 
-                                value={school}
-                                selected={school === initialContents?.school ? true : false}>
-                                    {school}
-                                </option>
-                            ))}
+                            {schoolOptions.map(() => undefined)}
                         </Form.Select>
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BooleanLiteral
main/components/Courses/CoursesForm.js:115:80
                                 <option 
                                 key={index} 
                                 value={school}
-                                selected={school === initialContents?.school ? true : false}>
+                                selected={school === initialContents?.school ? false : false}>
                                     {school}
                                 </option>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(UC Santa Barbara)

Expected the element to have value:
  UC Santa Barbara
Received:

[Killed] EqualityOperator
main/components/Courses/CoursesForm.js:115:43
                                 <option 
                                 key={index} 
                                 value={school}
-                                selected={school === initialContents?.school ? true : false}>
+                                selected={school !== initialContents?.school ? true : false}>
                                     {school}
                                 </option>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(UC Santa Barbara)

Expected the element to have value:
  UC Santa Barbara
Received:
  UC San Diego

[Survived] BooleanLiteral
main/components/Courses/CoursesForm.js:152:67
                             type="datetime-local"
                             isInvalid={Boolean(errors.startDate)}
                             defaultValue={defaultStartDate()}
-                            {...register("startDate", { required: true, pattern: isodate_regex })}
+                            {...register("startDate", { required: false, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">

[Survived] ObjectLiteral
main/components/Courses/CoursesForm.js:152:55
                             type="datetime-local"
                             isInvalid={Boolean(errors.startDate)}
                             defaultValue={defaultStartDate()}
-                            {...register("startDate", { required: true, pattern: isodate_regex })}
+                            {...register("startDate", {})}
                         />
                         <Form.Control.Feedback type="invalid">

[Survived] BooleanLiteral
main/components/Courses/CoursesForm.js:168:64
                             type="datetime-local"
                             isInvalid={Boolean(errors.endDate)}
                             defaultValue={defaultEndDate()}
-                            {...register("endDate", {required: true, pattern: isodate_regex })}
+                            {...register("endDate", {required: false, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
