[Killed] StringLiteral
main/components/Courses/CoursesForm.js:11:69
 
 
 
-function CoursesForm({ initialContents, submitAction, buttonLabel = "Create"}) { // schooloptions = drop down menu items
+function CoursesForm({ initialContents, submitAction, buttonLabel = ""}) { // schooloptions = drop down menu items
     const [schoolOptions, setSchoolOptions] = useState([]);
     useEffect(() => {
killedBy: CoursesForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ArrayDeclaration
main/components/Courses/CoursesForm.js:12:56
 
 
 function CoursesForm({ initialContents, submitAction, buttonLabel = "Create"}) { // schooloptions = drop down menu items
-    const [schoolOptions, setSchoolOptions] = useState([]);
+    const [schoolOptions, setSchoolOptions] = useState(["Stryker was here"]);
     useEffect(() => {
         enableEndDateValidation(); // Call the function to enable end date validation
killedBy: CoursesForm tests initializes with an empty array for school options
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <option value="Stryker was here">Stryker was here</option> instead

[Killed] BlockStatement
main/components/Courses/CoursesForm.js:13:21
 
 function CoursesForm({ initialContents, submitAction, buttonLabel = "Create"}) { // schooloptions = drop down menu items
     const [schoolOptions, setSchoolOptions] = useState([]);
-    useEffect(() => {
-        enableEndDateValidation(); // Call the function to enable end date validation
-        axios.get('/api/schools/all')
-            .then((data) => {
-                return data.data;
-            })
-            .then((jsonData) => {
-                const nameArray = jsonData.map(item => item.name);
-                setSchoolOptions(nameArray);
-            })
-    }, 
+    useEffect(() => {}, 
     // Stryker disable all
     []); 
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(UC Santa Barbara)

Expected the element to have value:
  UC Santa Barbara
Received:
  undefined

[Killed] BlockStatement
main/components/Courses/CoursesForm.js:16:29
     useEffect(() => {
         enableEndDateValidation(); // Call the function to enable end date validation
         axios.get('/api/schools/all')
-            .then((data) => {
-                return data.data;
-            })
+            .then((data) => {})
             .then((jsonData) => {
                 const nameArray = jsonData.map(item => item.name);
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
main/components/Courses/CoursesForm.js:19:33
             .then((data) => {
                 return data.data;
             })
-            .then((jsonData) => {
-                const nameArray = jsonData.map(item => item.name);
-                setSchoolOptions(nameArray);
-            })
+            .then((jsonData) => {})
     }, 
     // Stryker disable all
killedBy: CoursesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ArrowFunction
main/components/Courses/CoursesForm.js:20:48
                 return data.data;
             })
             .then((jsonData) => {
-                const nameArray = jsonData.map(item => item.name);
+                const nameArray = jsonData.map(() => undefined);
                 setSchoolOptions(nameArray);
             })
killedBy: CoursesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ArrowFunction
main/components/Courses/CoursesForm.js:94:48
                             {...register("school", { required: true })}
                         >
                             <option value="">Select a school</option>
-                            {schoolOptions.map((school, index) => (
-                                <option 
-                                    key={index} 
-                                    value={school}
-                                    selected={school === initialContents?.school ? true : false}
-                                >
-                                    {school}
-                                </option>
-                            ))}
+                            {schoolOptions.map(() => undefined)}
                         </Form.Control>
                     </Form.Group>
killedBy: CoursesForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:98:47
                                 <option 
                                     key={index} 
                                     value={school}
-                                    selected={school === initialContents?.school ? true : false}
+                                    selected={false ? true : false}
                                 >
                                     {school}
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(UC Santa Barbara)

Expected the element to have value:
  UC Santa Barbara
Received:

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:98:47
                                 <option 
                                     key={index} 
                                     value={school}
-                                    selected={school === initialContents?.school ? true : false}
+                                    selected={true ? true : false}
                                 >
                                     {school}
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(UC Santa Barbara)

Expected the element to have value:
  UC Santa Barbara
Received:
  UC San Diego

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:139:30
                             {...register("startDate", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.startDate && 'StartDate date is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /StartDate date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
